#include<stdio.h>

int main()
{
	int i,j;
	//新的初始化数组的写法
	//int a[]={45,56,79};  //正确，这种写法仅限于定义数组的时候立马初始化
	/* 
	int a[]; 错误
	a[0]=78;
	a[1]=96; 
	*/
	
	//定义二维数组
 	int n=88;
	//第一种：定义数组并立马部分初始化(定义数组立马赋值)
	//a[0][0]--a[0][1] --------a[3][2]
	//int a[4][3]={15,12,96}; //这个二维数组最多存放12个int

	//第二种：花括号嵌套花括号。里面的花括号代表一行数据
	//int a[4][3]={{15,12},96}; //第0行 15 12 */
	//语法错误，花括号的嵌套，花括号只能从左到右连续
	//还要求从第一组数据开始全部都要有花括号
/* 	int a[4][3]={{3,15},12,96}; //a[0][0] -->3
	//int a[4][3]={{3,15},{12},96}; 
	//int a[4][3]={{3,15},12,{96}};  //错误，花括号不连续
	//int a[4][3]={3,15,{12},{96}}; //错误，最前面的没有加花括号
	for(i=0; i<4; i++)
	{
		for(j=0; j<3; j++)
			printf("a[%d][%d] is:%d\n",i,j,a[i][j]);
	} */
	
	//第三种：
	//int a[][]={45,96,854}; //错误，编译器无法确定行和列的数量
	//int a[4][]={55,956,855}; //错误
	//int a[][3]={852,98546,5512};  //正确
	
	//第四种：考察一下逗号表达式的用法
 	//int a[4][3]={(45,96,n),96,78}; //{88,96,78}
	
	//第五种：通过两个下标去访问二维数组成员赋值
	int a[4][3]; //没有初始化，里面放的是随机数
	a[1][2]=85;
	a[0][2]=96;
	
	//第六种：键盘输入数据依次赋值
	int a[4][3];
	for(i=0; i<4; i++)
	{
		for(j=0; j<3; j++)
			scanf("%d",&a[i][j]);
	}   
	
	
}