#include<stdio.h>

int main()
{
	//定义二维数组
	//int n=88;
	//int a[4][3]={15,12,96};
	//int a[4][3]={{15,12},96};
	//int a[4][3]={3,{15,12},96};    ?????花括号必须从一个开始有，必须连续
	//int a[][]={45,96,854};   //错误范例
	
	//int a[4][]={55,956,855};//编译器无法确定行和列的数量如果是a[4][1] 如果是a[4][2],那么存放的值位置都不一样所以不合法
	int a[][3]={852,98456,5512};//这个就可以，无论是几行，赋的值都有确定的位置  牢记列不可以缺
    
	//int a[4][3]={(45,96,n),96,78};  //逗号表达式

    //for循环打印二维数组各位的值
	
	//int a[4][3]; //没有初始化，里面放的是随机数
	//a[1][2]=85;
	//a[0][2]=96;
	for(int i=0;i<4;i++)
	{
		for(int j=0;j<3;j++)
		{
			printf("a[%d][%d]的值为:%d\n",i,j,a[i][j]);
		}
	}
}